app/controllers/api/job_applications_controller.rb

INSERT INTO "job_applications" ("job_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["job_id", 34], ["user_id", 1], ["created_at", "2022-08-10 12:28:11.215795"], ["updated_at", "2022-08-10 12:28:11.215795"]]
---
    def create
      job_application = current_user.job_applications.new(permitted_params)

      if job_application.save

UPDATE "job_applications" SET "status" = ?, "updated_at" = ? WHERE "job_applications"."id" = ?  [["status", 0], ["updated_at", "2022-08-11 12:18:26.159891"], ["id", 4]]
---
    def update
      if job_application.update(updation_params)

SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."user_id" = ? AND "job_applications"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
---
    def job_application
      @job_application ||= current_user.job_applications.find(params[:id])